SrPatinhas/smarthalo-firmware/smart_halo-nrf5_sdk-e414c91a3966/SDK11/examples/ble_peripheral/experimental_ble_app_hids_keyboard_pairing_nfc/main.c
static void nfc_text_data_set(void)
{
    nfc_ndef_msg_desc_t *    p_nfc_text_message;
    nfc_ndef_record_desc_t * p_text_rec;
    NfcRetval                ret_val;
    uint32_t                 err_code = NRF_SUCCESS;

    /* Declare a text message to inform user that device is paired */
    NFC_NDEF_MSG_DEF(text_msg, 1);
    NFC_NDEF_TEXT_RECORD_DESC_DEF(text_rec,
                                  UTF_8,
                                  m_language,
                                  sizeof(m_language),
                                  m_nfc_text,
                                  sizeof(m_nfc_text));

    p_nfc_text_message = &NFC_NDEF_MSG(text_msg);
    p_text_rec         = &NFC_NDEF_TEXT_RECORD_DESC(text_rec);
    err_code           = nfc_ndef_msg_record_add(p_nfc_text_message, p_text_rec);
    APP_ERROR_CHECK(err_code);

    uint32_t ndef_msg_len = sizeof(ndef_msg_buf);
    err_code              = nfc_ndef_msg_encode(p_nfc_text_message, ndef_msg_buf, &ndef_msg_len);
    APP_ERROR_CHECK(err_code);

    ret_val = nfcSetPayload((char *)ndef_msg_buf, ndef_msg_len);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }
}

static void nfc_callback(void * context, NfcEvent event, const char *data, size_t dataLength)
{
    (void) context;
    uint32_t err_code;

    switch (event)
    {
        case NFC_EVENT_FIELD_ON:
        {
            NRF_LOG_PRINTF_DEBUG("NFC_EVENT_FIELD_ON");
            if (m_caps_on)
            {
                err_code = bsp_indication_set(BSP_INDICATE_ALERT_2);
            }
            else
            {
                err_code = bsp_indication_set(BSP_INDICATE_ALERT_3);
            }
            APP_ERROR_CHECK(err_code);

            /* Start advertising to become connectable. */
            if (!m_advertising_flag)
            {
                m_advertising_flag  = 1;
                advertising_enable();
                err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(err_code);
            }
        }break;//NFC_EVENT_FIELD_ON

        case NFC_EVENT_FIELD_OFF:
        {
            if (m_caps_on)
            {
                err_code = bsp_indication_set(BSP_INDICATE_ALERT_3);
            }
            else
            {
                err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
            }

            APP_ERROR_CHECK(err_code);
        }break;//NFC_EVENT_FIELD_OFF

        default:
            break;
    }
    return;
}


static void nfc_init(bool erase_bonds, bool wake_on_button)
{
    NfcRetval     ret_val;
    uint32_t      err_code;

    /* Start NFC */
    ret_val = nfcSetup(nfc_callback, NULL);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    /* Get the bonded peer number from peer_manager */
    if (!pm_peer_count() || erase_bonds)
    {
        nfc_pairing_data_set();
    }
    else
    {
        nfc_text_data_set();

        /* Bond with peer exists, so advertising should be started when wake up from button */
        if (wake_on_button)
        {
            m_advertising_flag  = 1;
            advertising_enable();
            err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
            APP_ERROR_CHECK(err_code);
        }
    }

    ret_val = nfcStartEmulation();
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    return;
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    /* Begin: Bugfix for FTPAN-45 */
    if (!NFC_NEED_MCU_RUN_STATE())
    {
    /* End:   Bugfix for FTPAN-45 */
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    /* Begin: Bugfix for FTPAN-45 */
    }
    /* End:   Bugfix for FTPAN-45 */
}


/***************************************************************************************************
 * End of modifications needed for BLE pairing over NFC
 **************************************************************************************************/

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds, wake_on_button;

    // Initialize.
    err_code = NRF_LOG_INIT();
    APP_ERROR_CHECK(err_code);
    timers_init();
    buttons_leds_init(&erase_bonds, &wake_on_button);
    ble_stack_init();
    scheduler_init();
    ble_conn_state_init();
    peer_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();
    nfc_init(erase_bonds, wake_on_button);
    

    // Start execution.
    timers_start();

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
